// 自動生成されたコードです。変更しないでください。
namespace myImages {

    helpers._registerFactory("image", function(name: string) {
        switch(helpers.stringTrim(name)) {
            case "image1":return img`
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
`;
            case "image2":
            case "orennjikun":return img`
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . . . . . . . . . . . 
. . . . . . 4 . 4 . . . . . . . 
. . . . . 4 4 . 4 4 . . . . . . 
. . . . . . f 4 f . . . . . . . 
. . . . . . f f f . . . . . . . 
. . . . . . 4 f 4 . . . . . . . 
. . . . . 4 f 4 f 4 . . . . . . 
. . . . 4 . f . f . 4 . . . . . 
. . . 4 . . 4 . 4 . . 4 . . . . 
. f 4 . . . 4 . 4 . . . 4 f . . 
. . f . . . . . . . . . f . . . 
. . . . . . . . . . . . . . . . 
`;
        }
        return null;
    })

    helpers._registerFactory("animation", function(name: string) {
        switch(helpers.stringTrim(name)) {

        }
        return null;
    })

}
// 自動生成されたコードです。変更しないでください。
